MP/src/InformationRegisters/КартинкиИФайлы/КартинкиИФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КартинкиИФайлы</name>
  <resources>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСохранения</name>
    <comment>Дата сохранения данных объекта</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерФайла</name>
    <comment>Исходный размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к файлу / картинке</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Данные</name>
    <comment>Хранилище данных картинки или файла</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеВоВнешнемФайле</name>
    <comment>Признак того, что данные храняться во внешнем файле</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Картинка</name>
    <comment>Признак того, что файл являеться картинкой</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>GUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектДляФайлов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <comment>Идентификационная строка, разделяющая данные объекта</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

MP/src/InformationRegisters/ФайлыДляОбмена/ФайлыДляОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФайлыДляОбмена</name>
  <resources>
    <name>НомерПринятого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектДляФайлов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <comment>Идентификационная строка, разделяющая данные объекта</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

MP/src/InformationRegisters/КартинкиИФайлы/RecordSetModule.bsl
Перем ФайлЗагружаетсяИзЦентральнойБазы Экспорт;

Процедура ПриЗаписи(Отказ, Замещение)
	// Вставить содержимое обработчика.        
	ТекОбъект = ЭтотОбъект.Отбор.Объект.Значение;  
	ТекИдентификатор = ЭтотОбъект.Отбор.Идентификатор.Значение;  
	
	
	Если НЕ ФайлЗагружаетсяИзЦентральнойБазы  И СтрНайти(Строка(ТекОбъект.Ссылка), "<Объект не найден> ") = 0 Тогда
	
		НаборЗаписей = РегистрыСведений.ФайлыДляОбмена.СоздатьНаборЗаписей(); 
		НаборЗаписей.Записывать = Истина;
		НаборЗаписей.Отбор.Объект.Установить(ТекОбъект, Истина);
		НаборЗаписей.Отбор.Идентификатор.Установить(ТекИдентификатор, Истина);       
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Объект =  ТекОбъект;      
		НоваяЗапись.Идентификатор =  ТекИдентификатор;   
		НоваяЗапись.НомерПринятого = Константы.УзелДляОбменаСЦентральнойБазой.Получить().НомерПринятого;    
		НоваяЗапись.ДатаВыгрузки = ТекущаяДата();
		
		НаборЗаписей.Записать();                                          
	КонецЕсли;
	
	                                   	
	// Записываем в регистр обмена 
КонецПроцедуры       

ФайлЗагружаетсяИзЦентральнойБазы = Ложь;
